app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "description", "picture", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save